Autodesk.Navisworks.Api.UnitVector3D
A vector with unit length. Represents a direction in 3D space. Immutable.

Autodesk.Navisworks.Api.UnitVector3D.#ctor(Autodesk.Navisworks.Api.Vector3D)
Create a unit vector from a vector, normalizing if required
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.#ctor(System.Double,System.Double,System.Double)
Create a unit vector from X, Y and Z components, normalizing if required

Autodesk.Navisworks.Api.UnitVector3D.Add(Autodesk.Navisworks.Api.Vector3D)
Adds a vector to this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Add(System.Double)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Angle(Autodesk.Navisworks.Api.UnitVector3D)
Returns the angle between this vector and another vector in the range [0, PI]
vector: vector to calculate angle with
Returns: angle in radians between this and vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.AngleWithReference(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Returns the angle between this vector and another vector in the range [-PI, PI], using a reference vector to determine the sign of the angle
vector: vector to calculate angle with
reference: reference vector pointing away from the plane containing this and vector
Returns: angle in radians between this and vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed
Throws System.ArgumentNullException:
Argument 'reference' is null
Throws System.ArgumentException:
Argument 'reference' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Cross(Autodesk.Navisworks.Api.Vector3D)
Returns the cross product between this vector and another
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.DirectionEquals(Autodesk.Navisworks.Api.Vector3D)
Compare with direction of vector using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.DirectionEquals(Autodesk.Navisworks.Api.Vector3D,System.Double)
Compare with direction of vector using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Divide(Autodesk.Navisworks.Api.Vector3D)
Divides this vector by another to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Divide(System.Double)
Divides every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Dot(Autodesk.Navisworks.Api.Vector3D)
Returns the dot product between this vector and another
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.UnitVector3D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.UnitVector3D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.UnitVector3D.IsZero
Is this a zero vector ? Will occur if all inputs to constructor are zero.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Item(System.Int32)


Autodesk.Navisworks.Api.UnitVector3D.Multiply(Autodesk.Navisworks.Api.Vector3D)
Multiplies a vector by this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Multiply(System.Double)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Negate
Returns a negated version of this vector (all components negated)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.op_Addition(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Adds two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.op_Addition(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.Vector3D)
Adds two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.op_Addition(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Addition(Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.UnitVector3D)
Adds two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.op_Addition(System.Double,Autodesk.Navisworks.Api.UnitVector3D)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Division(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Divides every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Implicit(Autodesk.Navisworks.Api.UnitVector3D)~Autodesk.Navisworks.Api.Vector3D
Converts a UnitVector3D to a Vector3D

Autodesk.Navisworks.Api.UnitVector3D.op_Multiply(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Multiply(System.Double,Autodesk.Navisworks.Api.UnitVector3D)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Subtraction(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Subtracts two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.op_Subtraction(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.Vector3D)
Subtracts two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.op_Subtraction(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Subtracts a value from every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.UnitVector3D.op_Subtraction(Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.UnitVector3D)
Subtracts two vectors to produce a new vector

Autodesk.Navisworks.Api.UnitVector3D.Subtract(Autodesk.Navisworks.Api.Vector3D)
Subtracts a vector from this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Subtract(System.Double)
Subtracts a value from every X, Y and Z coordinate in the Vector and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.TolerantEquals(Autodesk.Navisworks.Api.UnitVector3D)
Compare unit vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.TolerantEquals(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Compare vectors using a tolerance
Throws System.ArgumentNullException:
Argument 'vector0' is null
Throws System.ArgumentException:
Argument 'vector0' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.TolerantEquals(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Compare vectors using a tolerance
Throws System.ArgumentNullException:
Argument 'vector0' is null
Throws System.ArgumentException:
Argument 'vector0' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.TolerantEquals(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Compare unit vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.UnitVector3D.ToVector3D
Convert unit vector to a vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.UnitX
Returns a unit vector in the X direction (1,0,0)

Autodesk.Navisworks.Api.UnitVector3D.UnitY
Returns a unit vector in the Y direction (0,1,0)

Autodesk.Navisworks.Api.UnitVector3D.UnitZ
Returns a unit vector in the Z direction (0,0,1)

Autodesk.Navisworks.Api.UnitVector3D.X
Returns the X component of the vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Y
Returns the Y component of the vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.UnitVector3D.Z
Returns the Z component of the vector
Throws System.ObjectDisposedException:
Object has been Disposed